# 采用了生成器的方式来计算,实际上直接用for循环计算更方便.只是为了练习


def 等额本金(贷款金额, 贷款月利率, 贷款月数):
    月份 = 1
    本期还款本金 = 贷款金额 / 贷款月数
    while 月份 <= 贷款月数:

        本期还款利息 = (贷款金额 - 本期还款本金 * (月份 - 1)) * 贷款月利率

        yield 月份, 本期还款本金, 本期还款利息
        月份 += 1


def 等额本息(贷款金额, 贷款月利率, 贷款月数):

    本期还款金额 = (贷款金额 * 贷款月利率 * (1 + 贷款月利率)**贷款月数) / ((1 + 贷款月利率)**贷款月数 - 1)
    已还本金 = 0
    月份 = 1
    while 月份 <= 贷款月数:
        本期还款利息 = (贷款金额 - 已还本金) * 贷款月利率
        本期还款本金 = 本期还款金额 - 本期还款利息
        已还本金 += 本期还款本金

        yield 月份, 本期还款本金, 本期还款利息
        月份 += 1

    return 本期还款金额


# 贷款本金×月利率×（1+月利率）^还款月数]/[（1+月利率）^还款月数－1]

#贷款金额 = float(input("请输入贷款本金(万)")) * 10000
#贷款月利率 = float(input("请输入贷款年利率%")) / (100 * 12)
#贷款月数 = int(input("请输入贷款年数")) * 12
贷款金额 = 1140000
贷款月利率 = 5.4 / (12 * 100)
贷款月数 = 360
等额本金还款本金 = [0]
等额本金还款利息 = [0]
等额本金还款金额 = [0]
for n, x, y in 等额本金(贷款金额, 贷款月利率, 贷款月数):
    等额本金还款本金.append(x)
    等额本金还款利息.append(y)
    等额本金还款金额.append(x + y)

等额本息还款本金 = [0]
等额本息还款利息 = [0]
等额本息还款金额 = [0]
for m, a, b in 等额本息(贷款金额, 贷款月利率, 贷款月数):

    等额本息还款本金.append(a)
    等额本息还款利息.append(b)
    等额本息还款金额.append(a + b)

print('等额本金总还款额:%.0f,其中本金%.0f,利息%.0f' %
      (sum(等额本金还款金额), sum(等额本金还款本金), sum(等额本金还款利息)))
print('等额本息总还款额:%.0f,其中本金%.0f,利息%.0f' %
      (sum(等额本息还款金额), sum(等额本息还款本金), sum(等额本息还款利息)))

while True:
    print("***********************************")
    num = int(input('每月还款计划,请选择:\n  1.等额本金 \n  2.等额本息\n'))
    if num == 1:
        for x in range(1, 13):
            print('第%d个月还款总额%.0f, 其中本金%.0f,利息%.0f' %
                  (x, 等额本金还款金额[x], 等额本金还款本金[x], 等额本金还款利息[x]))
    elif num == 2:
        for x in range(1, 13):
            print('第%d个月还款总额%.0f, 其中本金%.0f,利息%.0f' %
                  (x, 等额本息还款金额[x], 等额本息还款本金[x], 等额本息还款利息[x]))
    else:
        break